# GetLeaders Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnnotationSymbol..::..GetLeaders Method
AnnotationSymbol Class See Also
---
Returns a collection of leaders currently attached to the annotation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<Leader> GetLeaders()
```

Visual Basic
---
```text
Public Function GetLeaders As IList(Of Leader)
```

Visual C++
---
```text
public:
IList<Leader^>^ GetLeaders()
```

# Remarks
This method supersedes an older _Leaders_ property which has been deprecated.
# See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace